

public class Exercize1 {


}
//Задача № 1:
//Создать коллекцию класса ArrayList, наполнив ее элементы типа Integer. С помощью
//Стрим'ов:
//        - Удалить дубликаты
//- Оставить только четные элементы
//- Вывести величину оставшихся элементов в стрим



//   Задача *:
//    Создать набор данных в формате id-имя, сохраненное на карте. Необходимо отобрать из
//    В этом наборе только те данные, идентификатор которых приводится в числовом диапазоне 1/2/5/8/9/13.
//    Среди эффектных результатов отобрать только те, которые имеют нечетное количество
//    буква в имени. После возврата этого списка Список имен, записанных букв назад.
//    Блок 3. Материалы для самостоятельной работы
//    Теоретические вопросы по занятости для самопроверки:
//